EDT_Demo/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиента</name>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT_Demo/src/Documents/ЗаказКлиента/ObjectModule.bsl
// @strict-types

#Область ОбработчикиСобытий

//@skip-check module-accessibility-at-client
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = СписокНоменклатуры.Итог("Сумма");
	
	СуммыСовпадают = ПроверитьТЧ();
	
	Если Не СуммыСовпадают Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//@skip-check module-accessibility-at-client
Функция ПроверитьТЧ()
	
	СуммаТЧ = 0;
	Для Каждого Строка Из СписокНоменклатуры Цикл
		СуммаТЧ = СуммаТЧ + Строка.Сумма;
	КонецЦикла;
		
	Возврат СуммаТЧ = СуммаДокумента;
	
КонецФункции

#КонецОбласти
